import 'package:palestine_console/palestine_console.dart';

class Converter {
  /**
   * TODO действия:
   * - сложения
   * - вычитания
   * - умножения
   * - деления
   */

  /**
   * TODO должны поддерживаться:
   * - числовые константы
   * - именованные переменные
   * - скобки
   */

  /**
   * TODO
   * - с функцией преобразования, принимающей Map с переменными (ключ - название переменной, значение - числовое значение, которое подставляется вместо переменной) и возвращающей значение типа double.
   */

  String line = '';

  Converter(this.line);
}
